Repository: viso-study/visocode
Catalog: locale/*/LC_MESSAGES/translation-example.po
Languages: de

source: This circle is drawn as I speak. The scene will wait for this sentence to finish before proceeding.
de: Dieser Kreis wird gezeichnet, während ich spreche. Die Szene wartet, bis dieser Satz beendet ist, bevor sie fortgesetzt wird.

source: Let's shift the circle to the left 2 units... This animation takes as long as this text to be read.
de: Verschieben wir den Kreis um 2 Einheiten nach links... Diese Animation dauert so lange, wie dieser Text zu lesen ist.

source: You can <bookmark mark='A'/>trigger animations <bookmark mark='B'/>at any word in the middle of a sentence by adding <bookmark mark='C'/>bookmarks to your text.
de: Sie können <bookmark mark='A'/>Animationen <bookmark mark='B'/>bei jedem Wort in der Mitte eines Satzes auslösen, indem Sie <bookmark mark='C'/>Lesezeichen in Ihren Text einfügen.

source: Here is another example for more fine-tuned bookmarking. Super<bookmark mark='A'/>cali<bookmark mark='B'/>fragilistic<bookmark mark='C'/>expiali<bookmark mark='D'/>docious.
de: Hier ist ein weiteres Beispiel für eine feinere Abstimmung der Lesezeichen. Super<bookmark mark='A'/>cali<bookmark mark='B'/>fragilistic<bookmark mark='C'/>expiali<bookmark mark='D'/>docious.

source: Now let's talk about subtitles. Subtitles are automatically generated as a ".srt" file next to the video output. By default, the subtitle is the same as the text, however you can modify this behavior by specifying the subcaption property.
de: Kommen wir nun zu den Untertiteln. Untertitel werden automatisch als ".srt" Datei neben der Videoausgabe generiert. Standardmäßig ist der Untertitel derselbe wie der Text, aber Sie können dieses Verhalten ändern, indem Sie die Eigenschaft subcaption angeben.

source: This is a custom subcaption that lasts the duration of this scene. You can say facts like Yotsuba is the best Quintuplet.
de: Dies ist ein benutzerdefinierter Untertitel, der für die Dauer der Szene gilt. Sie können z. B. sagen, dass Yotsuba das beste Quintuplet ist.

source: Why would this be helpful? Many times, we want to insert LaTeX into the subcaptions, however the text-to-speech isn't able to pronounce it correctly. As an example, here's the L2 norm of a vector and Mass-energy Equivalence.
de: Warum ist das hilfreich? Oft wollen wir LaTeX in die Untertitel einfügen, aber die Text-to-Speech-Funktion ist nicht in der Lage, sie richtig auszusprechen. Als Beispiel hier die L2-Norm eines Vektors und die Masse-Energie-Äquivalenz.

source: Why would this be helpful? Many times, we want to insert LaTeX into the subcaptions, however the text-to-speech isn't able to pronounce it correctly. As an example, here's $\left\lVert{x}\right\rVert_2$ and $e = mc^2$
de: Warum ist das hilfreich? Oft wollen wir LaTeX in die Untertitel einfügen, aber die Text-to-Speech-Anwendung ist nicht in der Lage, sie richtig auszusprechen. Hier ein Beispiel: $\left\lVert{x}\right\rVert_2$ und $e = mc^2$

source: This also allows us to add SSML-like customizations to the voiceover, like "insert emotion" into the voices ———————— or add "pauses"....... without affecting the subcaption. This works on ElevenLabs... but not GTTS.
de: So können wir auch SSML-ähnliche Anpassungen in das Voiceover einfügen, z. B. "Emotion einfügen" in die Stimmen -------- oder "Pausen einfügen" ......., ohne die Untertitel zu beeinflussen. Dies funktioniert bei ElevenLabs... aber nicht bei GTTS.

source: This also allows us to add SSML-like customizations to the voiceover, like insert emotion into the voices, or add pauses... without affecting the subcaption. This works on ElevenLabs but not GTTS.
de: Dies ermöglicht uns auch SSML-ähnliche Anpassungen des Voiceovers, wie z. B. das Einfügen von Emotionen in die Stimmen oder das Hinzufügen von Pausen... ohne die Untertitel zu beeinflussen. Dies funktioniert mit ElevenLabs, aber nicht mit GTTS.
